{
    "description": "Here we have a Rising Arc exhibit.You can see there are two metal rods in Y shape attached at the base. When you press the switch, something fascinating happens! A bright electric arc appears between the rods at the base and starts moving upward. After reaching a certain height this arc disappears. Let’s see how it works!  When you press the switch, a high potential of about 25000 volts is applied across the rods. This is like the power source behind an electric arc.The high voltage is so strong that it breaks down the insulation of the air between the rods at the narrowest part of the gap. It’s similar to when you rub your feet against a carpet and then touch a metal object, causing a spark. The air between the rods can’t resist the powerful voltage. Once the insulation of air is broken, an electric arc is formed. This is like a mini lightning bolt that connects the two rods. Now, here’s where things get interesting! The arc moves upward due to a combination of heating and electromagnetic effects. The intense heat generated by the arc causes the surrounding air to expand. It’s like a hot air balloon, where the hot air rises and lifts the balloon upward. Similarly, the heat from the arc creates a flow of air that pushes the arc upward.As the arc moves upward, it takes an increasingly longer path. This happens because the voltage drop across the arc increases with its length. Eventually, the applied voltage becomes insufficient to maintain the arc, and it breaks at a certain point.A horn gap arrester works on this principle. It provides a safe path for the high voltage to be grounded, protecting the circuits from damage. Usually these are used in railways or near the Transformer in the substation. Electricity can be both fascinating and practical. Exploring its behavior and how we can control it allows us to use electricity in a safe and efficient way. To learn more about high voltage, please check the details of our High Voltage Demonstration Show at the reception."
}